# SQL Joins: TMDb Database
© Explore Data Science Academy

## Instructions to Students

This challenge is designed to determine how much you have learned so far and will test your knowledge on join SQL statements.

The answers for this challenge should be selected on Athena for each corresponding Multiple Choice Question. The questions are included in this notebook and are numbered according to the Athena Questions, the options to choose from for each question have also been included.

Do not add or remove cells in this notebook. Do not edit or remove the `%%sql` comment as it is required to run each cell.

**_Good Luck!_**

## Honour Code

I HUMPHERY, OJO, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

## The TMDb Database

In this challenge you will be exploring the [The Movie Database](https://www.themoviedb.org/) - an online movie and TV show database, which houses some of the most popular movies and TV shows at your finger tips. The TMDb database supports 39 official languages used in over 180 countries daily and dates all the way back to 2008. 


<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>


Below is an Entity Relationship diagram(ERD) of the TMDb database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ER diagram, the TMDb database consists of `12 tables` containing information about movies, cast, genre and so much more.  

Let's get started!

## Loading the database

To begin and start making use of SQL queries you need to prepare your SQL environment you can do this by loading in the magic command `%load_ext sql`, next you can go ahead and load in your database. To do this you will need to ensure you have downloaded the `TMDB.db`sqlite file from Athena and have stored it in a known location. Now that you have all the prerequisites you can go ahead and load it into the notebook.

In [1]:
%load_ext sql

In [2]:
%%sql 

sqlite:///C:\Users\Jerry\Documents\ExploreDataFiles\SQL\Basic_SQL_queries-data_and_notebook-a-1957\TMDB.db

(sqlite3.OperationalError) unable to open database file
(Background on this error at: http://sqlalche.me/e/e3q8)
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

## Questions on SQL Join Statements 

Use the given cell below each question to execute your SQL queries to find the correct input from the options provided for the multiple choice questions on Athena.

**Question 1**

What is the primary key for the table “movies”?

**Options:** 
 - title
 - movie_key
 - film_id
 - movie_id

**Solution**

In [3]:
%%sql 
select count(movie_id) from movies

 * sqlite:///C:\Users\Jerry\Documents\ExploreDataFiles\SQL\Basic_SQL_queries-data_and_notebook-a-1957\TMDB.db
Done.

[(4803,)]

**Question 2**

How many foreign keys does the “LanguageMap” table have?

**Options:**

 - 0
 - 2
 - 3
 - 1

**Solution**

In [4]:
%%sql 
select * from LanguageMap limit 3

 * sqlite:///C:\Users\Jerry\Documents\ExploreDataFiles\SQL\Basic_SQL_queries-data_and_notebook-a-1957\TMDB.db
Done.

[(868, 'af'), (1123, 'af'), (1372, 'af')]

**Question 3**

How many movies in the database were produced by Pixar Animation Studios?

**Options:**
 - 16
 - 14
 - 18
 - 20

**Solution**

In [16]:
%%sql 
select count(a.production_company_name) as production_company_name
from productioncompanies as a 
left join productioncompanymap as b on a.production_company_id=b.production_company_id
left join movies c on b.movie_id=c.movie_id where a.production_company_name = 'Pixar Animation Studios'

 * sqlite:///C:\Users\Jerry\Documents\ExploreDataFiles\SQL\Basic_SQL_queries-data_and_notebook-a-1957\TMDB.db
Done.

[(16,)]

**Question 4**

What is the most popular action movie that has some German in it? (Hint: The German word for German is Deutsch)

**Options:**
 - The Bourne Identity
 - Mission: Impossible - Rogue Nation
 - Captain America: Civil War
 - Quantum of Solace

**Solution**

In [3]:
%%sql 
SELECT * FROM movies
WHERE language = 'Deutsch'
AND genre = 'Action';

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

**Question 5**

In how many movies did Tom Cruise portray the character Ethan Hunt? (Hint: Characters are listed in the Casts table.)

**Options:**
 - 4
 - 3
 - 6
 - 5

**Solution**

In [19]:
%%sql 
select count(a.actor_name) as movie_count,a.actor_name,b.characters from actors a 
left join casts b on a.actor_id=b.actor_id where a.actor_name='Tom Cruise' and b.characters='Ethan Hunt'

 * sqlite:///C:\Users\Jerry\Documents\ExploreDataFiles\SQL\Basic_SQL_queries-data_and_notebook-a-1957\TMDB.db
Done.

[(5, 'Tom Cruise', 'Ethan Hunt')]

**Question 6**

How many times was the actress Cate Blanchett nominated for an Oscar?
 
 **Options:**
 - 7
 - 4
 - 5
 - 2

**Solution**

In [42]:
%%sql 
select count(name),name as name,CASE WHEN winner IS NULL THEN 'Nominated'ELSE winner END nominated_count
from oscars where name='Cate Blanchett' and winner is NULL

 * sqlite:///C:\Users\Jerry\Documents\ExploreDataFiles\SQL\Basic_SQL_queries-data_and_notebook-a-1957\TMDB.db
Done.

[(5, 'Cate Blanchett', 'Nominated')]

**Question 7**

How many movies were nominated for the Best Picture award at the Oscars?
 
**Options:**

 - 12
 - 16
 - 8
 - 18

**Solution**

In [43]:
%%sql 
select count(award) as [award nominated] from movies a 
left join oscars b on a.title=b.name
 where b.award ='Best Picture'

 * sqlite:///C:\Users\Jerry\Documents\ExploreDataFiles\SQL\Basic_SQL_queries-data_and_notebook-a-1957\TMDB.db
Done.

[(8,)]

**Question 8** 

How many movies contain at least one of the languages, Afrikaans or Zulu?

**Options:**
 - 10
 - 8
 - 12
 - 15

**Solution**

In [40]:
%%sql 
SELECT COUNT(movie_id) as [movie count]
FROM Movies
WHERE movie_id IN (SELECT movie_id FROM languagemap WHERE iso_639_1 in ('af','zu'))

 * sqlite:///C:\Users\Jerry\Documents\ExploreDataFiles\SQL\Basic_SQL_queries-data_and_notebook-a-1957\TMDB.db
Done.

[(8,)]

**Question 9**

In which country was the movie “Star Wars” produced?  

**Options:**
 - Canada
 - United Kingdom
 - France
 - United States of America

**Solution**

In [39]:
%%sql 
select a.movie_id,a.title,c.production_country_name from movies a
left join productioncountrymap b on a.movie_id=b.movie_id
left join productioncountries c on c.iso_3166_1=b.iso_3166_1
where a.title='Star Wars'

 * sqlite:///C:\Users\Jerry\Documents\ExploreDataFiles\SQL\Basic_SQL_queries-data_and_notebook-a-1957\TMDB.db
Done.

[(11, 'Star Wars', 'United States of America')]

**Question 10**

How many movies are in the database that are both a Romance and a Comedy?

**Options:**

 - 373
 - 484
 - 262
 - 595

**Solution**

In [38]:
%%sql 
SELECT COUNT(movie_id) as [movie count]
FROM Movies
WHERE movie_id IN (SELECT movie_id FROM genremap WHERE genre_id = 10749)
AND movie_id IN (SELECT movie_id FROM genremap WHERE genre_id = 35)

 * sqlite:///C:\Users\Jerry\Documents\ExploreDataFiles\SQL\Basic_SQL_queries-data_and_notebook-a-1957\TMDB.db
Done.

[(484,)]